       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARRAYS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 ARRAY-ELEMENT PIC 9(2) OCCURS 10 TIMES 
                INDEXED BY ELEMENT-INDEX.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           ACCEPT ELEMENT-INDEX.
           ACCEPT ARRAY-ELEMENT(ELEMENT-INDEX).
           DISPLAY ARRAY-ELEMENT(ELEMENT-INDEX).
           STOP RUN.
       END PROGRAM ARRAYS.