(44)  01  W-DATE-FORM.
(45)      05 W-JJ                PIC XX.
(46)      05 FILLER              PIC X            VALUE '.'.
(47)      05 W-MM                PIC XX.
(48)      05 FILLER              PIC X            VALUE '.'.
(49)      05 W-AA                PIC XX.
