       01  W-DATE-FORM.
           05 W-JJ                PIC XX.
           05 FILLER              PIC X            VALUE '.'.
           05 W-MM                PIC XX.
           05 FILLER              PIC X            VALUE '.'.
           05 W-AA                PIC XX.