       01 PERSON.
           88 EOF  VALUE HIGH-VALUES.
           05 AGE PIC 9(2).
           05 FILLER PIC X.
           05 FIRSTNAME PIC X(6).
           05 FILLER PIC X.
           05 SURNAME PIC X(7).