ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
   DECIMAL-POINT IS COMMA.
   CLASS VALID-NAME-CHARACTERS IS 'a' THRU 'z' 'A' THRU 'Z' ' '.